micropython/micropython/ports/esp32/network_wlan.c
    if (args[ARG_bssid].u_obj != mp_const_none) {
        p = mp_obj_str_get_data(args[ARG_bssid].u_obj, &len);
        if (len != sizeof(wifi_sta_config.sta.bssid)) {
            mp_raise_ValueError(NULL);
        }
        wifi_sta_config.sta.bssid_set = 1;
        memcpy(wifi_sta_config.sta.bssid, p, sizeof(wifi_sta_config.sta.bssid));
    }

    switch (min_sec) {
        case WIFI_AUTH_OPEN:
            mp_printf(&mp_plat_print, "Warning: SEC_OPEN is insecure and should be avoided!\n");
            break;

        case WIFI_AUTH_WPA_PSK:
            mp_printf(&mp_plat_print, "Warning: SEC_WPA is insecure and should be avoided!\n");
            break;

        case WIFI_AUTH_WPA2_WPA3_PSK:
            // map to WPA2, otherwise defaults to WPA3 only
            // ESP-IDF always chooses the strongest available auth
            min_sec = WIFI_AUTH_WPA2_PSK;
        // fall through

        case WIFI_AUTH_WPA2_PSK:
            break;

        case WIFI_AUTH_WPA3_PSK:
            break;

        case WIFI_AUTH_WPA2_WPA3_ENTERPRISE:
            // map to WPA2, otherwise defaults to WPA3 only
            // ESP-IDF always chooses the strongest available auth
            min_sec = WIFI_AUTH_WPA2_ENTERPRISE;
        // fall through

        case WIFI_AUTH_WPA2_ENTERPRISE:
            break;

        case WIFI_AUTH_WPA3_ENTERPRISE:
            // Device will always connect in PMF mode if AP advertises PMF capability
            // in all WPA_ENT methods
            // But we want to be able to enforce this on the client side
            wifi_sta_config.sta.pmf_cfg.required = args[ARG_pmf_req].u_bool;
            break;

        default:
            // issue parameter not supported error
            mp_raise_ValueError(MP_ERROR_TEXT("unknown config value for min_sec."));
            break;
    }
    wifi_sta_config.sta.threshold.authmode = min_sec;

    esp_exceptions(esp_wifi_set_config(ESP_IF_WIFI_STA, &wifi_sta_config));
    // that's it for WPA Personal

    if (min_sec == WIFI_AUTH_WPA2_ENTERPRISE || min_sec == WIFI_AUTH_WPA3_ENTERPRISE) {
        int16_t esp_eap_method;
        int16_t eap_method = (int16_t)args[ARG_eap_method].u_int;
        int16_t ttls_phase2_method = (int16_t)args[ARG_ttls_phase2_method].u_int;

        // set esp_eap_method explicitly, otherwise ESP-IDF defaults to EAP-PEAP with MSCHAPv2
        switch (eap_method) {
            case WIFI_AUTH_EAP_PWD:
                // TYPE_PWD is not provided so we set it to ALL
                esp_eap_method = ESP_EAP_TYPE_ALL;
                break;

            case WIFI_AUTH_EAP_PEAP:
                esp_eap_method = ESP_EAP_TYPE_PEAP;
                break;

            case WIFI_AUTH_EAP_TTLS:
                esp_eap_method = ESP_EAP_TYPE_TTLS;
                break;

            case WIFI_AUTH_EAP_TLS:
                esp_eap_method = ESP_EAP_TYPE_TLS;
                break;

            default:
                mp_raise_ValueError(MP_ERROR_TEXT("eap_method wrong, missing or EAP_NONE: not allowed for WPA Enterprise."));
                break;
        }
        esp_exceptions(esp_eap_client_set_eap_methods(esp_eap_method));

        if (eap_method == WIFI_AUTH_EAP_PWD || eap_method == WIFI_AUTH_EAP_PEAP || eap_method == WIFI_AUTH_EAP_TTLS) {
            // use username and password
            if (args[ARG_username].u_obj != mp_const_none) {
                p = mp_obj_str_get_data(args[ARG_username].u_obj, &len);
                esp_exceptions(esp_eap_client_set_username((const unsigned char *)p, len));
            } else {
                mp_raise_ValueError(MP_ERROR_TEXT("missing config param username."));
            }
            if (args[ARG_password].u_obj != mp_const_none) {
                p = mp_obj_str_get_data(args[ARG_password].u_obj, &len);
                esp_exceptions(esp_eap_client_set_password((const unsigned char *)p, len));
            } else {
                mp_raise_ValueError(MP_ERROR_TEXT("missing config param password."));
            }
        }

        if (eap_method == WIFI_AUTH_EAP_PEAP || eap_method == WIFI_AUTH_EAP_TTLS) {
            // additionally use identity and ca_cert
            if (args[ARG_identity].u_obj != mp_const_none) {
                p = mp_obj_str_get_data(args[ARG_identity].u_obj, &len);
                esp_exceptions(esp_eap_client_set_identity((const unsigned char *)p, len));
            } else {
                mp_raise_ValueError(MP_ERROR_TEXT("missing config param identity."));
            }
            if (args[ARG_ca_cert].u_obj != mp_const_none) {
                p = mp_obj_str_get_data(args[ARG_ca_cert].u_obj, &len);
                // see comment (1) below.
                esp_exceptions(esp_eap_client_set_ca_cert((const unsigned char *)p, len + 1));
            } else {
                mp_raise_ValueError(MP_ERROR_TEXT("missing config param ca_cert."));
            }
        }

        if (eap_method == WIFI_AUTH_EAP_TTLS) {
            // additionally use ttls_phase2_method, defaulting to MSCHAPV2 (and then very similar to EAP-PEAP)
            // tested and verified with all 5 supported phase 2 methods
            if (ttls_phase2_method < ESP_EAP_TTLS_PHASE2_EAP || ttls_phase2_method > ESP_EAP_TTLS_PHASE2_CHAP) {
                mp_raise_ValueError(MP_ERROR_TEXT("unknown config value for ttls_phase2_method."));
            }
            esp_exceptions(esp_eap_client_set_ttls_phase2_method(ttls_phase2_method));
        }

        if (eap_method == WIFI_AUTH_EAP_TLS) {
            // UNTESTED!
            // EAP-TLS uses client cert, private key, and (optionally) private key password, and (optionally) ca_cert
            // please note that this release does not implement WIFI_AUTH_WPA3_ENT_192
            // The reason is outlined here: https://eduroam.org/eduroam-and-wpa3/
            size_t client_cert_len = 0;
            const char *client_cert = NULL;
            size_t private_key_len = 0;
            const char *private_key = NULL;
            size_t private_key_password_len = 0;
            const char *private_key_password = NULL;

            mp_printf(&mp_plat_print, "\nPlease note that EAP-TLS is so far UNTESTED and thus EXPERIMENTAL.\nUse at your own risk!\n\n");
            if (args[ARG_client_cert].u_obj != mp_const_none) {
                client_cert = mp_obj_str_get_data(args[ARG_client_cert].u_obj, &client_cert_len);
            } else {
                mp_raise_ValueError(MP_ERROR_TEXT("missing config param client_cert."));
            }
            if (args[ARG_private_key].u_obj != mp_const_none) {
                private_key = mp_obj_str_get_data(args[ARG_private_key].u_obj, &private_key_len);
            } else {
                mp_raise_ValueError(MP_ERROR_TEXT("missing config param private_key."));
            }
            if (args[ARG_private_key_password].u_obj != mp_const_none) {        // password is optional
                private_key_password = mp_obj_str_get_data(args[ARG_private_key_password].u_obj, &private_key_password_len);
            }
            // disable time check or not
            if (args[ARG_disable_time_check].u_bool == true) {
                esp_exceptions(esp_eap_client_set_disable_time_check(true));
            }

